## 🏗️ Terraform Plan Preview

## 📋 Terraform Plan Summary

### Resource Changes

- ✅ **Resources to Add:** 4
- 🔄 **Resources to Change:** 1
- ❌ **Resources to Destroy:** 0
0

<details>
<summary>📄 Full Plan Output (click to expand)</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lb.main has changed
  ~ resource "aws_lb" "main" {
      + arn                                         = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/b4cd1ec1b9a2bde9"
      + dns_name                                    = "protein-classifier-alb-292100480.us-west-2.elb.amazonaws.com"
        id                                          = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/b4cd1ec1b9a2bde9"
        name                                        = "protein-classifier-alb"
        tags                                        = {
            "Name" = "protein-classifier-alb"
        }
      + zone_id                                     = "Z1H1FL5HABSF5"
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-west-2:462498369025:cluster/protein-classifier-api-1-0-0-prod-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "protein-classifier-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "protein-classifier-api-service"
        }
      + tags_all                           = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api-service"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + task_definition                    = "arn:aws:ecs:us-west-2:462498369025:task-definition/protein-classifier-api:3"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "protein-classifier-api"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:462498369025:targetgroup/protein-classifier-ecs-tg/8a6ccffd3d4c3116"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0822fb8754073fb32",
            ]
          + subnets          = [
              + "subnet-034dbf0d24493ddf3",
              + "subnet-0a9d6de07abc7f763",
            ]
        }
    }

  # aws_iam_role_policy.github_actions_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "github_actions_policy" {
        id     = "protein-classifier-github-actions-role:github-actions-deployment-policy"
        name   = "github-actions-deployment-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (6 unchanged elements hidden)
                    {
                        Action   = [
                            "kms:CreateKey",
                            "kms:DescribeKey",
                            "kms:GetKeyPolicy",
                            "kms:GetKeyRotationStatus",
                            "kms:ListResourceTags",
                            "kms:TagResource",
                            "kms:UntagResource",
                            "kms:PutKeyPolicy",
                            "kms:EnableKeyRotation",
                            "kms:CreateAlias",
                            "kms:DeleteAlias",
                            "kms:UpdateAlias",
                            "kms:ListAliases",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:us-west-2:462498369025:key/*",
                            "arn:aws:kms:us-west-2:462498369025:alias/*",
                        ]
                        Sid      = "KMSKeyManagement"
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                          + "kms:Encrypt",
                          + "kms:GenerateDataKey",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:us-west-2:462498369025:key/e9b37450-f4df-45d6-a336-aefd3b1d0896"
                      + Sid      = "KMSDynamoDBEncryption"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_lb.main is tainted, so must be replaced
-/+ resource "aws_lb" "main" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/b4cd1ec1b9a2bde9" -> (known after apply)
      ~ arn_suffix                                                   = "app/protein-classifier-alb/b4cd1ec1b9a2bde9" -> (known after apply)
      ~ dns_name                                                     = "protein-classifier-alb-292100480.us-west-2.elb.amazonaws.com" -> (known after apply)
      ~ drop_invalid_header_fields                                   = false -> true
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/b4cd1ec1b9a2bde9" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
        name                                                         = "protein-classifier-alb"
      + name_prefix                                                  = (known after apply)
        tags                                                         = {
            "Name" = "protein-classifier-alb"
        }
      ~ vpc_id                                                       = "vpc-09f46860bd3f1f05c" -> (known after apply)
      ~ zone_id                                                      = "Z1H1FL5HABSF5" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "protein-classifier-alb-logs-462498369025"
          ~ enabled = false -> true
          + prefix  = "alb-logs"
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-067b8b58bdacbd8ef" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-097cbe6706c0bba59" -> null
        }
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-west-2:462498369025:certificate/bd8958a6-a142-42df-82bb-1cdb82456ff6"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-Ext1-2021-06"
      + tags_all                                                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:462498369025:targetgroup/protein-classifier-ecs-tg/8a6ccffd3d4c3116"
          + type             = "forward"
        }
    }

  # aws_route53_record.api will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.proteinclassifier.com"
      + type            = "A"
      + zone_id         = "Z0960642JHAEZB1G2JKV"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 5 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + alb_dns_name            = (known after apply)
```
</details>

### 🔍 Key Changes Detected

- 🐳 **ECS Service** changes detected
- ⚖️ **Load Balancer** changes detected
- 🔑 **IAM** changes detected

### ✅ Validation Status

- **Format Check:** ⚠️ Needs formatting
- **Init:** ✅ Pass
- **Validate:** ✅ Pass
- **Plan:** ✅ Pass


---
<sub>💡 This plan preview helps you review infrastructure changes before applying them.</sub>
